/*
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*/
OS_STK           App_TaskInteractionStk[256];


/*
*********************************************************************************************************
*                                          App_TaskStart()
*
* Description : 交互进程，它会对键盘解码然后根据键盘码进行显示操作
*
* Argument(s) : p_arg       Argument passed to 'App_TaskStart()' by 'OSTaskCreate()'.
*
* Return(s)   : none.
*
* Caller(s)   : This is a task.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void TaskInteraction(void *p_arg)
{
  while (1)
  {
       OSTaskSuspend(12);
  }
}